Documents/ПереносЗанятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>ПереносЗанятия</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>ПервоначальноеЗанятие</Name>
      <ValueType><v8:Type>cfg:DocumentRef.Занятие</v8:Type><v8:TypeQualifiers><v8:Type>cfg:DocumentRef.Занятие</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>НовоеЗанятие</Name>
      <ValueType><v8:Type>cfg:DocumentRef.Занятие</v8:Type><v8:TypeQualifiers><v8:Type>cfg:DocumentRef.Занятие</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ПричинаПереноса</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаПереноса</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Исполнитель</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Пользователи</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Пользователи</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>НоваяДата</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>НовоеВремяНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>НовоеВремяОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыЗанятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыЗанятия</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Запланировано</Name>
    </Value>
    <Value>
      <Name>Подтверждено</Name>
    </Value>
    <Value>
      <Name>Проведено</Name>
    </Value>
    <Value>
      <Name>Отменено</Name>
    </Value>
    <Value>
      <Name>Перенесено</Name>
    </Value>
    <Value>
      <Name>НеСостоялось</Name>
    </Value>
  </Properties>
</MetaDataObject>

Documents/Занятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Занятие</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>ДатаЗанятия</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Преподаватель</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Аудитория</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Аудитории</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Аудитории</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Направление</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Направления</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Направления</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ТипЗанятия</Name>
      <ValueType><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыЗанятия</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыЗанятия</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <TabularSection>
      <Name>Участники</Name>
      <Attributes>
        <Attribute>
          <Name>Клиент</Name>
          <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Абонемент</Name>
          <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>СтатусПосещения</Name>
          <ValueType><v8:Type>cfg:EnumRef.СтатусыПосещения</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыПосещения</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Стоимость</Name>
          <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Комментарий</Name>
          <ValueType><v8:Type>xs:string</v8:Type></ValueType>
        </Attribute>
      </Attributes>
    </TabularSection>

  </ChildObjects>
</MetaDataObject>

Documents/ПереносЗанятия/Ext/ObjectModule.bsl
// Модуль документа Перенос занятия

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// 1. Первоначальное занятие -> статус "Перенесено"
	Первоначальное = ПервоначальноеЗанятие.ПолучитьОбъект();
	Первоначальное.Статус = Перечисления.СтатусыЗанятия.Перенесено;
	Первоначальное.Записать();

	// 2. Создание нового занятия и перенос клиентов
	Новое = Документы.Занятие.СоздатьДокумент();
	Новое.Дата = НоваяДата;
	Новое.ДатаЗанятия = НоваяДата;
	Новое.ВремяНачала = НовоеВремяНачала;
	Новое.ВремяОкончания = НовоеВремяОкончания;
	Новое.Преподаватель = Первоначальное.Преподаватель;
	Новое.Аудитория = Первоначальное.Аудитория;
	Новое.Направление = Первоначальное.Направление;
	Новое.ТипЗанятия = Первоначальное.ТипЗанятия;
	Новое.Статус = Перечисления.СтатусыЗанятия.Запланировано;
	Новое.Комментарий = "Перенесено из " + Строка(ПервоначальноеЗанятие) + ". Причина: " + ПричинаПереноса;

	Для Каждого Участник ИЗ Первоначальное.Участники Цикл
		НовыйУчастник = Новое.Участники.Добавить();
		НовыйУчастник.Клиент = Участник.Клиент;
		НовыйУчастник.Абонемент = Участник.Абонемент;
	КонецЦикла;

	Новое.Записать(РежимЗаписиДокумента.Проведение);

	// 3. Связь между первоначальным и новым занятием
	НовыйОбъект = Новое.ПолучитьОбъект();
	НовыйОбъект.Комментарий = НовыйОбъект.Комментарий;
	НовыйОбъект.Записать();

	НовоеЗанятие = Новое.Ссылка;

	АудитДействий.ЗарегистрироватьИзменение(ЭтотОбъект, "Перенос занятия",
		Строка(ПервоначальноеЗанятие), Строка(НовоеЗанятие));
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустоеЗначение(ПервоначальноеЗанятие) Тогда
		Сообщить("Не указано первоначальное занятие");
		Отказ = Истина;
	КонецЕсли;
	Если Не ПустоеЗначение(НоваяДата) И (НовоеВремяОкончания <= НовоеВремяНачала) Тогда
		Сообщить("Некорректное время нового занятия");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
